
products = [
    {
        "id": 1,
        "name": "Tommy Hilfiger Th85",
        "image": "Tommy Hilfiger.jpeg",
        "description": "Aνδρικό ρολόι Tommy Hilfiger Automatic από ανοξείδωτο ατσάλι με λευκό καντράν και μαύρο δερμάτινο λουράκι.",
        "likes": 32,
        "price": 327
    },
    {
        "id": 2,
        "name": "Emporio Armani Ανδρικό Ρολόι 43mm Αυτόματο με Ασημί Μεταλλικό Μπρασελέ",
        "image": "Emporio Armani.jpeg",
        "description": "Το ρολόι της Emporio Armani είναι μια εξαιρετική επιλογή με μοναδικό στυλ και εντυπωσιακή κατασκευή. Το μεταλλικό μπρασελέ του δίνει μία κομψή αίσθηση, ιδανικό για κάθε περίσταση. Το Υλικό του είναι φτιαγμένο από Μεταλλικό Μπρασελέ, προσφέροντας αντοχή και στιλ. Η Λειτουργία του είναι Αναλογικό, παρέχοντας ευκολία στην ανάγνωση της ώρας.",
        "likes": 2,
        "price": 1.197
    },
    {
        "id": 3,
        "name": "Casio Limited Edition Ψηφιακό Ρολόι Μπαταρίας με Ασημί Δερμάτινο Λουράκι",
        "image": "Casio.jpeg",
        "description": "Το ρολόι της Casio είναι από ανοξείδωτο ατσάλι με γκρι καντράν και μαύρο μπρασελέτ. Αντέχει μέχρι και 200 μέτρα κάτω από την επιφάνεια της θάλασσας",
        "likes": 16,
        "price": 1792
    },
    {
        "id": 4,
        "name": "Tissot T66.1.722.31 Ρολόι Αυτόματο",
        "image": "Tissot.jpeg",
        "description": "TISSOT Heritage 150th Anniversary Automatic Chronograph με Ασημί καντράν με ταχύμετρο & ημερομηνία, κρύσταλλο Hesalite.",
        "likes": 17,
        "price": 2070
    },
    {
        "id": 5,
        "name": "Festina Ρολόι Μπαταρίας με Ασημί Μεταλλικό Μπρασελέ",
        "image": "Festina.jpeg",
        "description": "Ένα ρολόι για τον άνδρα με QUARTZ μηχανισμό. Το πλαίσιο είναι από ΑΝΟΞΕΙΔΩΤΟ ΑΤΣΑΛΙ και το χρώμα του καντράν είναι ΜΑΥΡΟ. Το κρύσταλλο είναι ΑΧΑΡΑΚΤΟ ΖΑΦΕΙΡΙ με διάμετρο 47.30mm. Διαθέτει δέσιμο ΜΠΡΑΣΕΛΕ ΑΝΟΞΕΙΔΩΤΟ ΑΤΣΑΛΙ με κούμπωμα ΑΣΦΑΛΕΙΑΣ. Η αδιαβροχοποίησή του είναι μέχρι 30ATM - 300ΜΕΤΡΑ.",
        "likes": 3,
        "price": 1590
    },
    {
        "id": 6,
        "name": "Seiko Ρολόι Αυτόματο με Ασημί Μεταλλικό Μπρασελέ",
        "image": "Seiko.jpeg",
        "description": "Το ρολόι Seiko SPB381J1 συνδυάζει κομψότητα και λειτουργικότητα, ιδανικό για καθημερινή χρήση και ειδικές περιστάσεις. Με τον κλασικό σχεδιασμό του και την ανθεκτικότητα του, αποτελεί μία εξαιρετική επιλογή για τους άνδρες που αναζητούν ποιότητα και στυλ.",
        "likes": 10,
        "price": 1800
    },
    {
        "id": 7,
        "name": "Hugo Boss Ρολόι Μπαταρίας με Μεταλλικό Μπρασελέ",
        "image": "Hugo Boss.jpeg",
        "description": "Το ρολόι Hugo Boss συνδυάζει στυλ και λειτουργικότητα, κάνοντάς το ιδανικό για κάθε άνδρα που θέλει να αποπνέει κομψότητα. Με μεταλλικό μπρασελέ, προσφέρει ανθεκτικότητα και μακροχρόνια χρήση. Το χρώμα του μπρασελέ είναι ασημί, κάνοντάς το εύκολο να συνδυαστεί με διάφορα ρούχα και στυλ, είτε πρόκειται για επίσημες εκδηλώσεις είτε για καθημερινές εμφανίσεις.",
        "likes": 12,
        "price": 687
    },
    {
        "id": 8,
        "name": "Burberry Ανδρικό Ρολόι 42mm Χρονογράφος Μπαταρίας με Ασημί Μεταλλικό Μπρασελέ",
        "image": "Burberry.jpeg",
        "description": "Το Burberry Ρολόι Χρονογράφος Μπαταρίας με Ασημί Μεταλλικό Μπρασελέ BU9350 συνδυάζει κομψότητα και λειτουργικότητα. Αυτό το ρολόι είναι ιδανικό για τους άνδρες που αναζητούν ένα αξιόπιστο και στυλάτο αξεσουάρ. Το Υλικό του ρολογιού είναι κατασκευασμένο από Μεταλλικό Μπρασελέ, προσφέροντας ανθεκτικότητα και άνεση κατά τη διάρκεια της ημέρας",
        "likes": 22,
        "price": 806
    },
    {
        "id": 9,
        "name": "Beverly Hills Polo Club Ανδρικό Ρολόι Αυτόματο με Ασημί Μεταλλικό Μπρασελέ",
        "image": "Beverly Hills.jpeg",
        "description": "Ανδρικό Ρολόι BEVERLY HILLS POLO CLUB Automatic από ανοξείδωτο ατσάλι με μαύρο-skeleton καντράν και μπρασελέ.",
        "likes": 14,
        "price": 335
    },
    {
        "id": 10,
        "name": "Certus Stainless Ανδρικό Ρολόι Αυτόματο με Μαύρο Μεταλλικό Μπρασελέ",
        "image": "Certus.jpeg",
        "description": "Ανδρικό αυτόματο ρολόι τύπου Skeleton από τον Γαλλικό Οίκο ρολογιών Certus. Χαρακτηριστικά: Κάσα από ανοξείδωτο ατσάλι σε μαύρη απόχρωση, Διάμετρος 38mm, Μαύρο καντράν με παύλες, Διάφανο καπάκι που αποκαλύπτει την λειτουργία του αυτόματου μηχανισμού, Ορυκτό κρύσταλλο ειδικής σκλήρυνσης, Μαύρο ατσάλινο μπρασελέ, Αδιάβροχο 5ΑΤΜ",
        "likes": 0,
        "price": 218
    },
    {
        "id": 11,
        "name": "Dior Ανδρικό Ρολόι 27mm Μπαταρίας με Ασημί Μεταλλικό Μπρασελέ",
        "image": "Dior.jpeg",
        "description": "υτό το ρολόι από τη μάρκα Dior συνδυάζει στυλ και λειτουργικότητα. Το μπρασελέ του είναι κατασκευασμένο από μεταλλικό υλικό, προσφέροντας αντοχή και κομψότητα. Η λειτουργία του είναι αναλογική, κάτι που διευκολύνει την ανάγνωση της ώρας με κλασικό τρόπο. Ο χρώμα λουριού είναι σε όμορφο ασημί, ιδανικό για κάθε περίσταση. Ο μηχανισμός λειτουργεί με μπαταρία,...",
        "likes": 14,
        "price": 483
    },
    {
        "id": 12,
        "name": "Dolce & Gabbana Ανδρικό Ρολόι 40mm Μπαταρίας με Μαύρο Μεταλλικό Μπρασελέ",
        "image": "Dolce Gabbana.jpeg",
        "description": "D&G Ανδρικό Ρολόι Μέ Μαύρο Καντράν Καί Ασημί Δείκτες DW 0663. Μπρασελέ με μαύρο καντράν και ασημί δείκτες, Μηχανισμός: Quartz, Κωδικός: DW 0663",
        "likes": 0,
        "price": 350
    },
    {
        "id": 13,
        "name": "Ellesse Ανδρικό Ρολόι 45mm Χρονογράφος Μπαταρίας με Ασημί Μεταλλικό Μπρασελέ",
        "image": "Ellesse.jpeg",
        "description": "Αυτό το ρολόι προσφέρει μια κομψή και λειτουργική επιλογή για κάθε άνδρα που εκτιμά την ποιότητα και το στυλ. Είναι εξοπλισμένο με μεταλλικό μπρασελέ σε ασημί απόχρωση, που προσθέτει μια αίσθηση πολυτέλειας. Η λειτουργία είναι αναλογική, παρέχοντας ευκολία στην ανάγνωση της ώρας, ενώ ο μηχανισμός μπαταρίας εξασφαλίζει ακριβή και αξιόπιστη λειτουργία.",
        "likes": 0,
        "price": 340
    },
    {
        "id": 14,
        "name": "Guess Ανδρικό Ρολόι Μπαταρίας με Χρυσό Μεταλλικό Μπρασελέ",
        "image": "Guess.jpeg",
        "description": "Το ρολόι GUESS Mod. GW0497G4 είναι η τέλεια επιλογή για όσους αναζητούν κομψά και στιλάτα αξεσουάρ. Αυτό το μοντέλο συνδυάζει μοντέρνο σχεδιασμό με υψηλή ποιότητα κατασκευής, καθιστώντας το ιδανικό συμπλήρωμα για κάθε στυλ",
        "likes": 10,
        "price": 449
    },
    {
        "id": 15,
        "name": "Gant Ανδρικό Ρολόι 41mm Χρονογράφος Μπαταρίας με Χρυσό Μεταλλικό Μπρασελέ",
        "image": "Gant.jpeg",
        "description": "Ανδρικό ρολόι GANT από ανοξείδωτο ατσάλι. Χαρακτηριστικά: Μαύρο καντράν, Χρυσό μπρασελέ",
        "likes": 18,
        "price": 251
    },
    {
        "id": 16,
        "name": "TAG Heuer Ανδρικό Ρολόι 39mm Χρονογράφος Μπαταρίας με Μπλε Δερμάτινο Λουράκι",
        "image": "TAG Heuer.jpeg",
        "description": "Το ανδρικό ρολόι TAG Heuer συνδυάζει στυλ και λειτουργικότητα με εξαιρετική ποιότητα κατασκευής. Το 39mm μέγεθος του είναι ιδανικό για καθημερινή χρήση, προσφέροντας μια κομψή εμφάνιση χωρίς να θυσιάζει την άνεση. Αυτό το ρολόι διαθέτει χρονόμετρο, επιτρέποντας ακριβείς μετρήσεις χρόνου για κάθε σας δραστηριότητα. Η λειτουργία του είναι αναλογική και λειτουργεί με μηχανισμό μπαταρίας, εξασφαλίζοντας αξιόπιστη και σταθερή λειτουργία.",
        "likes": 29,
        "price": 7.150
    },
    {
        "id": 17,
        "name": "Plaisir Durable 92585 Ανδρικό Ρολόι Μπαταρίας με Χρυσό Μεταλλικό Μπρασελέ",
        "image": "Plaisir Durable.jpeg",
        "description": "Ανακαλύψτε το Plaisir Durable 92585, ένα ανδρικό ρολόι που συνδυάζει στυλ και πρακτικότητα. Διαθέτει μεταλλικό μπρασελέ σε εντυπωσιακό χρυσό χρώμα, που προσθέτει μια αίσθηση πολυτέλειας στην εμφάνισή σας. Η αναλογική λειτουργία του ρολογιού σας παρέχει ακριβή ένδειξη του χρόνου, ενώ ο μηχανισμός μπαταρίας εξασφαλίζει σταθερή και αξιόπιστη λειτουργία χωρίς την ανάγκη συνεχούς ρύθμισης.",
        "likes": 0,
        "price": 5.525
    },
    {
        "id": 18,
        "name": "Raymond Weil Ανδρικό Ρολόι Χρονογράφος Αυτόματο με Μαύρο Δερμάτινο Λουράκι",
        "image": "Raymond Weil.jpeg",
        "description": "Το RAYMOND WEIL x BASQUIAT Special Edition είναι μια μοναδική συνεργασία που συνδυάζει τον νεο-εξπρεσιονισμό με την παραδοσιακή ωρολογοποιία ακρίβειας. Το σχέδιο του ρολογιού περιλαμβάνει καλλιτεχνικά στοιχεία από τον διάσημο καλλιτέχνη Basquiat, με πρωταγωνιστή το «Pez Dispenser» και τον δεινόσαυρο με την κορώνα, αντίγραφα από το γνωστό έργο του 1984. Υπάρχουν επίσης διάσπαρτα σύμβολα που χρησιμοποιεί ο καλλιτέχνης όπως το σύμβολο του δολαρίου και η κορώνα, εμπλουτίζοντας την αισθητική του ρολογιού.",
        "likes": 0,
        "price": 5.170
    },
    {
        "id": 19,
        "name": "Fortis Ανδρικό Ρολόι Αυτόματο με Μπλε Δερμάτινο Λουράκι",
        "image": "Fortis.jpeg",
        "description": "Ανακαλύψτε ένα εξαιρετικό ανδρικό ρολόι που συνδυάζει κομψότητα και λειτουργικότητα. Το Fortis Αυτόματο Ρολόι διαθέτει ένα ελκυστικό μπλε δερμάτινο λουρί, προσφέροντας άνεση και στυλ κατά την καθημερινή σας χρήση. Η λειτουργία του είναι αναλογική, καθιστώντας τον αναγκαίο σύντροφο στις δραστηριότητές σας, ενώ ο μηχανισμός του είναι automatic, εξασφαλίζοντας ακριβή ώρα χωρίς την ανάγκη αλλαγής μπαταρίας.",
        "likes": 0,
        "price": 4.950
    },
    {
        "id": 20,
        "name": "Oris Ανδρικό Ρολόι 41.5mm Αυτόματο με Πράσινο Μεταλλικό Μπρασελέ",
        "image": "Oris.jpeg",
        "description": "Ρολόι Oris Man 63570742277FC. Μηχανισμός: Αυτόματος, Τύπος Ένδειξης: Αναλογική, Υλικό Κάσας: Ανοξείδωτο Ατσάλι, Χρώμα Κάσας: Γκρι, Υλικό Λουριού: Καουτσούκ, Χρώμα Λουριού: Πράσινο, Χρώμα Δακτυλίου: Πράσινο, Τύπος Γυαλιού: Ζαφείρι, Κλείσιμο: Αναδιπλούμενο, Διάμετρος Δακτυλίου: 41,50 mm, Βαθμός Υποβρύχιας Χρήσης: 30ATM",
        "likes": 0,
        "price": 3.890
    }
]